InformationRegisters/ЛБ_РеестрБезначныхПлатежейПереплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежейПереплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПереплатаНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОборотыПоОперациямЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОборотыПоОперациямЗайма</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Comment>Залоговый билет</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КЗачислению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРазбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоПолностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоВыяснения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВозврату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтнесеноВДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_УправлениеБезналичнымиПлатежамиПереплата/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда 
		РеестрПлатежей = Параметры.РеестрПлатежей;
	КонецЕсли;
	
	Переплаты.Параметры.УстановитьЗначениеПараметра("РеестрПлатежей", РеестрПлатежей);
	Переплаты.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
	Переплаты.Параметры.УстановитьЗначениеПараметра("ПустойСтатус", Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка());
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Если РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда
		Элементы.РасшифровкаПереплаты.КоманднаяПанель.ПодчиненныеЭлементы.УточнитьИЗачислить.Видимость = Ложь; 
		Элементы.РасшифровкаПереплатыОплатаПроценты.Видимость = Ложь; 
		Элементы.РасшифровкаПереплатыОплатаЗайм.Видимость = Ложь;
		Элементы.РасшифровкаПереплатыНомерЗБФакт.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция  ПолучитьДатуСеанса() 
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервере
Функция ПолучитьЗБ(НомерЗБ)  
	Если НЕ ПустаяСтрока(НомерЗБ) Тогда
	    Возврат ЛБ_Общиймодуль.ПолучитьЗБПоНомеру(НомерЗБ);  
	КонецЕсли;
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПолучитьСтатусПереплаты(Стр)
	Если НЕ (Стр.ОплатаПроценты + Стр.ОплатаЗайм) = 0 Тогда 
		Возврат ?(Стр.Переплата = 0, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично);
	ИначеЕсли НЕ стр.Возврат = 0 Тогда
		Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено;
	ИначеЕсли НЕ стр.ВДоходы = 0 Тогда
		Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы;	
	КонецЕсли;	                                                        
	Возврат Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура ЗаполнитьРасшифровку(ДатаПлатежа, ИдентификаторПлатежа, НомерЗБ, СуммаПлатежа, Переплата)  
	РасшифровкаПереплаты.Очистить();
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);  
	Запрос.УстановитьПараметр("СуммаПлатежа", СуммаПлатежа);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ПереплатаНачальная КАК ПереплатаНачальная,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СтатусПлатежа КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ОплатаПроценты КАК ОплатаПроценты,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ОплатаЗайм КАК ОплатаЗайм,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Переплата КАК Переплата,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Возврат КАК Возврат,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Ответственный КАК Ответственный,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ДокументОплаты КАК ДокументОплаты,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РеестрБезначныхПлатежейПереплаты
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.СуммаПлатежа = &СуммаПлатежа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаНачальныхПереплат = ТаблицаЗапроса.Скопировать(); 
	ТаблицаНачальныхПереплат.Свернуть("ПереплатаНачальная");
	Для Каждого Стр Из ТаблицаНачальныхПереплат Цикл	
		Отбор = новый Структура;
		Отбор.Вставить("ПереплатаНачальная", Стр.ПереплатаНачальная);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
		Если Строки.Количество() > 1 Тогда
			СтрЗ = Строки.Получить(0);
			Если СтрЗ.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Выборка = Строки.Получить(0);
		Стр = РасшифровкаПереплаты.Добавить();
		Стр.ДатаПлатежа = ДатаПлатежа;
		Стр.ИдентификаторПлатежа = ИдентификаторПлатежа;
		Стр.НомерЗБ = НомерЗБ;  
		Стр.СуммаПлатежа = СуммаПлатежа; 
		Стр.ПереплатаНачальная = Выборка.ПереплатаНачальная;
		Стр.ОплатаПроценты = Выборка.ОплатаПроценты;
		Стр.ОплатаЗайм = Выборка.ОплатаЗайм;
		Стр.Переплата = Выборка.Переплата;  
		Стр.Возврат = Выборка.Возврат; 
		Стр.ДатаПеревода = Выборка.Период;  
		Стр.Ответственный = Выборка.Ответственный; 
		Стр.ДокументОплаты = Выборка.ДокументОплаты; 
		Стр.ЗалоговыйБилет = Выборка.ЗалоговыйБилет; 
		Если ЗначениеЗаполнено(Стр.ЗалоговыйБилет) И НЕ (СокрЛП(НомерЗБ) = СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета))  Тогда
		    Стр.НомерЗБФакт = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;
		КонецЕсли;	 
		Стр.ИтоговыйСтатус = Выборка.СтатусПлатежа;
	Конеццикла;  
	РасшифровкаПереплаты.Сортировать("ДатаПеревода");
	
	Если РасшифровкаПереплаты.Количество() = 0 Тогда 
		СтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(ТекущаяДатаСеанса(), РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
		Если НЕ СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
			Стр = РасшифровкаПереплаты.Добавить(); 
			Стр.ДатаПлатежа = ДатаПлатежа;
			Стр.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Стр.НомерЗБ = НомерЗБ;
			Стр.СуммаПлатежа = СуммаПлатежа;
			Стр.ПереплатаНачальная = Переплата;
		КонецЕсли;	
	Иначе	     
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПроверкаПереплаты.Переплата КАК Переплата
		               |ИЗ
		               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты.СрезПоследних(
		               |			,
		               |			РеестрПлатежей = &РеестрПлатежей
		               |				И ДатаПлатежа = &ДатаПлатежа
		               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
		               |				И НомерЗБ = &НомерЗБ) КАК ПроверкаПереплаты
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ПроверкаПереплаты.Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда    
			Если НЕ Выборка.Переплата = 0 Тогда 
				Стр = РасшифровкаПереплаты.Добавить(); 
				Стр.ДатаПлатежа = ДатаПлатежа;
				Стр.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Стр.НомерЗБ = НомерЗБ; 
				Стр.СуммаПлатежа = СуммаПлатежа;
		        Стр.ПереплатаНачальная = Выборка.Переплата;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПереплатыПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.Переплата); 
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ПриОткрытии(Отказ)
   	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда  
		ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.Переплата);
	Иначе
		РасшифровкаПереплаты.Очистить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя(ЗалоговыйБилет) 
	Возврат ЗалоговыйБилет.Залогодатель;
КонецФункции	

&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет)  Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя(ТекСтрока.ЗалоговыйБилет));
			ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
									
			ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция КоличествоПлатежейПоЗБ(СтруктураПлатежа) 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РеестрПлатежей", СтруктураПлатежа.РеестрПлатежей); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет);     
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                |	СУММА(ВЫБОР
	                |			КОГДА ЛБ_ОборотыПоОперациямЗайма.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)
	                |				ТОГДА 1
	                |			ИНАЧЕ -1
	                |		КОНЕЦ) КАК Количество
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма КАК ЛБ_ОборотыПоОперациямЗайма
	                |ГДЕ
	                |	ЛБ_ОборотыПоОперациямЗайма.РеестрПлатежей = &РеестрПлатежей
	                |	И ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет = &ЗалоговыйБилет
	                |	И ЛБ_ОборотыПоОперациямЗайма.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЛБ_ОборотыПоОперациямЗайма.ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;	
	Возврат 0;
КонецФункции	

&НаСервере
Функция ЗачислитьПлатеж(СтруктураПлатежа)
	Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
	    ДатаДок = КонецДня(СтруктураПлатежа.ДатаПлатежа)-9 + КоличествоПлатежейПоЗБ(СтруктураПлатежа);
	Иначе  
		ДатаДок = СтруктураПлатежа.ДатаПлатежа;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда   
		Выкуп = Ложь;  
		Если СтруктураПлатежа.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
			Если НачалоДня(СтруктураПлатежа.ЗалоговыйБилет.Дата) = НачалоДня(СтруктураПлатежа.ДатаПлатежа) Тогда
				РезультатПроверки = ЛБ_ОбщийМодуль.ПроверитьРасчетыПоЗалоговомуБилету(ДатаДок, СтруктураПлатежа.ЗалоговыйБилет, Истина); 
				Если (РезультатПроверки.ОстатокПроценты + РезультатПроверки.ОстатокЗайм) <= СтруктураПлатежа.СуммаПлатежа Тогда
					Выкуп = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		РезультатПроценты = ЛБ_ОбщийМодуль.РасчитатьДолгПроценты(ДатаДок, СтруктураПлатежа.ЗалоговыйБилет, Выборка.СтатусЗБ, Выборка.ДатаНачалаРасчетаПроцентов, Выборка.ПричинаПрименения, Выкуп); 
        ДокументОбъект = РезультатПроценты.ДокументОбъект; 
		СуммаПроцентовНачисленно = РезультатПроценты.СуммаПроценты;
		Если СтруктураПлатежа.СуммаПлатежа > СуммаПроцентовНачисленно Тогда 
			СуммаОплатыПроценты = СуммаПроцентовНачисленно; 
			Переплата = СтруктураПлатежа.СуммаПлатежа - СуммаОплатыПроценты; 
		Иначе
			СуммаОплатыПроценты = СтруктураПлатежа.СуммаПлатежа;
			Переплата = 0;
		КонецЕсли;	
					
    	ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
		ДокументОбъект.БезналичнаяОплата = Истина;
	    ДокументОбъект.ПредыдущаяОперация = СтруктураПлатежа.ЗалоговыйБилет;
		ДокументОбъект.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей;  
		ДокументОбъект.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
		ДокументОбъект.ДатаПлатежа = СтруктураПлатежа.ДатаПлатежа; 
		ДокументОбъект.ИдентификаторПлатежа = СтруктураПлатежа.ИдентификаторПлатежа; 
		ДокументОбъект.НомерЗБПлатежа = СтруктураПлатежа.НомерЗБ;   
		ДокументОбъект.РаспределениеПереплаты = Истина;
	    ДокументОбъект.Организация = СтруктураПлатежа.ЗалоговыйБилет.Организация; 
	    ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
		    СтрокиТоварыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
				КонецЕсли;	
			КонецЦикла;	
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
		КонецЕсли;	
		
		ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель);
		
		ДокументОбъект.Ломбард = СтруктураПлатежа.ЗалоговыйБилет.Ломбард; 
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		//ДокументОбъект.Залогодатель = СтруктураПлатежа.ЗалоговыйБилет.Залогодатель;  
		ДокументОбъект.СхемаКредитования = СтруктураПлатежа.ЗалоговыйБилет.СхемаКредитования;  
		ДокументОбъект.СрокЗалога = СтруктураПлатежа.ЗалоговыйБилет.СрокЗалога; 
		ДокументОбъект.Акция = СтруктураПлатежа.ЗалоговыйБилет.Акция;
		ДокументОбъект.НомерЗалоговогоБилета = СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета; 
		СуммаОплатыСсуда = 0;                                                                                                                       
		
		ТаблицаТоваров = Новый ТаблицаЗначений; 
		ТаблицаТоваров.Колонки.Добавить("ОбъектЗалога"); 
		ТаблицаТоваров.Колонки.Добавить("СтатусОбъекта");
		ТаблицаТоваров.Колонки.Добавить("СуммаОценки");  
		ТаблицаТоваров.Колонки.Добавить("СуммаОплаты");
		ТаблицаТоваров.Колонки.Добавить("Задолженность"); 
		
		ЗапросОст = новый Запрос;   
		ЗапросОст.УстановитьПараметр("ЗалоговыйБилет", СтруктураПлатежа.ЗалоговыйБилет); 
		ЗапросОст.УстановитьПараметр("Дата", ДатаДок); 
		
		ЗапросОст.Текст = "ВЫБРАТЬ
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
		               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
		               |ИЗ
		               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
    	ТаблицаЗапроса = ЗапросОст.Выполнить().Выгрузить(); 

		ЗапросОст.Текст = "ВЫБРАТЬ
               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
               |ИЗ
               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
               |
               |СГРУППИРОВАТЬ ПО
               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард";
        ТаблицаОстатков = ЗапросОст.Выполнить().Выгрузить(); 
	   
	    Для каждого стр Из СтруктураПлатежа.ЗалоговыйБилет.Товары цикл  
		   Если СтруктураПлатежа.ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			   Если НЕ Стр.Переоформить тогда
				   Продолжить;
			   КонецЕсли;	
		   КонецЕсли;	      
		   НоваяСтр = ТаблицаТоваров.Добавить(); 
		   НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;
		   НоваяСтр.СтатусОбъекта = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок, НоваяСтр.ОбъектЗалога, СтруктураПлатежа.ЗалоговыйБилет);  
		   НоваяСтр.СуммаОценки = стр.СуммаСсуды; 
		   НоваяСтр.СуммаОплаты = 0;   
		   СуммаОплатыНач = 0;
		   Отбор = Новый структура;
		   Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		   Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		   Если НЕ строки.Количество() = 0 тогда			
			   СуммаОплатыНач = Строки.Получить(0).СуммаОплаты;                                 
		   КонецЕсли;	 
		   НоваяСтр.Задолженность = НоваяСтр.СуммаОценки - СуммаОплатыНач; 
	    Конеццикла;	

		Если ДокументОбъект.РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет И НЕ Переплата = 0 Тогда   								   
			СуммаОплатыСсуда = ?(ТаблицаТоваров.Итог("Задолженность") < Переплата, ТаблицаТоваров.Итог("Задолженность"),  Переплата); 		   
	        СуммаДляРаспределения = СуммаОплатыСсуда;
			ОбъектЗалогаМакс = Справочники.ЛБ_ОбъектыЗалога.ПустаяСсылка(); 
			МаксЗадолженность = 0;
			ЗадолженностьНачИтог = ТаблицаТоваров.Итог("Задолженность");
			Для каждого СтрТ Из ТаблицаТоваров Цикл 
			   Коэфф = СтрТ.Задолженность/ЗадолженностьНачИтог;
			   СтрТ.СуммаОплаты = СуммаОплатыСсуда*Коэфф;
			   СуммаДляРаспределения = СуммаДляРаспределения - СтрТ.СуммаОплаты;
			   Если СтрТ.Задолженность > МаксЗадолженность Тогда
				   МаксЗадолженность = СтрТ.Задолженность;  
				   ОбъектЗалогаМакс = стрТ.ОбъектЗалога;
			   КонецЕсли;	
		   КонецЦикла;
		   Если НЕ СуммаДляРаспределения = 0 Тогда 
			   Отбор = Новый Структура;
			   Отбор.Вставить("ОбъектЗалога", ОбъектЗалогаМакс);
			   Строки = ТаблицаТоваров.Найтистроки(Отбор);
			   Если НЕ Строки.Количество() = 0 тогда
				   СтрТ = Строки.Получить(0);
				   СтрТ.СуммаОплаты = СтрТ.СуммаОплаты + СуммаДляРаспределения;
			   КонецЕсли;	
		   КонецЕсли;  
		   Переплата = Переплата - ТаблицаТоваров.Итог("СуммаОплаты");
	    КонецЕсли;      
		
	    ДокументОбъект.Выкуп = ?(ТаблицаТоваров.Итог("Задолженность") - ТаблицаТоваров.Итог("СуммаОплаты") = 0, Истина,  Ложь);   
		   
	    Для каждого стрТ из ТаблицаТоваров Цикл 		
		   Отбор = новый структура;
		   Отбор.Вставить("ОбъектЗалога", стрТ.ОбъектЗалога);
		
		   СтрокиТ = ДокументОбъект.Товары.НайтиСтроки(Отбор); 
		   Если НЕ СтрокиТ.Количество() = 0 Тогда
			   СтрТТ = строкиТ.получить(0);    
		       СтрТТ.СуммаОценки = СтрТ.Задолженность;
		       СтрТТ.СуммаОплаты = СтрТ.СуммаОплаты; 
		   КонецЕсли;	   
	    Конеццикла;	

		СтруктураЗБ = ЛБ_Общиймодуль.ПолучитьСостояниеЗалоговогоБилета(ДокументОбъект, СтруктураПлатежа.ЗалоговыйБилет);		
		ДокументОбъект.ДатаВыкупа = СтруктураЗБ.ДатаВыкупа;
		ДокументОбъект.ДатаВыкупаЛьготная = СтруктураЗБ.ДатаВыкупаЛьготныйСрок;
	    ДокументОбъект.СуммаСсуды = ТаблицаТоваров.Итог("Задолженность") - ТаблицаТоваров.Итог("СуммаОплаты");
		ДокументОбъект.СуммаОплаты = СуммаОплатыПроценты + СуммаОплатыСсуда;
		ДокументОбъект.СуммаОплатыПроценты = СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = СуммаОплатыСсуда;     
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка           
		    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			СообщениеЗачет = "";						  
			Если Выборка.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВключенВНакладную ИЛИ
				 Выборка.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОбъявленТорг Тогда 
				ПСЗ = ЛБ_ОбщийМодуль.ПолучитьПредельныйСрокЗаймаДата(Структураплатежа.ЗалоговыйБилет);
                Если ПСЗ < НачалоДня(ДокументОбъект.Дата) Тогда
				    Накладная = ЛБ_УправлениеЛомбардом.ПолучитьНакладнуюНаОтгрузкуЗалогоговогоБилета(ДокументОбъект.Дата, СтруктураПлатежа.ЗалоговыйБилет);
				    СообщениеЗачет = "Внимание! По ЗБ № " + сокрЛП(СтруктураПлатежа.ЗалоговыйБилет.НомерЗалоговогоБилета) + " достигнут предельный срок займа."  + Символы.ПС +
					                 "После зачисления платежа ЗБ НЕ ИСКЛЮЧЕН из накладной № " + СокрЛП(Накладная.НомерНакладной) + " от " + Формат(Накладная.Дата, "ДФ=dd.MM.yyyy"); 
			    КонецЕсли;	 
           	КонецЕсли;	
		
			Результат = новый Структура;
		   	Результат.Вставить("ОплатаПроценты", СуммаОплатыПроценты);
			Результат.Вставить("ОплатаЗайм", СуммаОплатыСсуда);
			Результат.Вставить("Переплата", Переплата); 
			Результат.Вставить("ДокументОплаты", ДокументОбъект.Ссылка); 
			Результат.Вставить("СтатусПлатежа", ?(СтруктураПлатежа.СуммаПлатежа > ДокументОбъект.СуммаОплаты, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично, Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью));
			Результат.Вставить("Сообщение", СообщениеЗачет);                                          
			Возврат Результат;   
		Исключение   			
			Возврат неопределено;
		КонецПопытки;  
	КонецЕсли;	
КонецФункции	
	
&НаСервере
Функция ПолучитьТекущийстатусЗБ(ЗалоговыйБилет)
	Возврат ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ПолучитьДатуСеанса(), ЗалоговыйБилет);
КонецФункции

&НаСервере
Функция ПолучитьОстатокПереплаты(ДатаПлатежа, ИдентификаторПлатежа, НомерЗБ) 
	Возврат ЛБ_ОбщийМодуль.РассчитатьОстатокПереплатыБезналичногоПлатежа(ТекущаяДатаСеанса(), РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ); 
КонецФункции

&НаКлиенте
Процедура УточнитьИЗачислить(Команда) 
	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ТекСтрока.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
		Возврат;
	КонецЕсли;	
		
	ОстатокПереплаты = ПолучитьОстатокПереплаты(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ); 
	Если ОстатокПереплаты = 0 Тогда
		Предупреждение("Сумма переплаты полностью распределена.", 60);
		Возврат; 
	КонецЕсли;	
	
	ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные; 
	ПараметрыФормы = Новый структура;   
	ПараметрыФормы.Вставить("РеестрПлатежей", РеестрПлатежей); 
	ПараметрыФормы.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	ПараметрыФормы.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	ПараметрыФормы.Вставить("СуммаПлатежа", ОстатокПереплаты);
	ПараметрыФормы.Вставить("НомерЗБ", ТекСтрока.НомерЗБ); 
	ПараметрыФормы.Вставить("Переплата", Истина);
		
	ОбработкаВыбора = Новый ОписаниеОповещения("ЗачислитьПослеУточнения",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_УточнениеБезналичногоПлатежа", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаформы.БлокироватьОкноВладельца);  
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьФактическиеДанныеЗаемщика(ЗалоговыйБилет)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("ФИОЗаемщика", "");
	СтруктураВ.Вставить("НомерТелефона", "");  
	СтруктураВ.Вставить("НомерЛомбарда", ЗалоговыйБилет.Ломбард.НомерЛомбарда);
    СтруктураВ.Вставить("Отделение", ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), ЗалоговыйБилет.Ломбард));
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Залогодатель", ЗалоговыйБилет.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя + "" "" + ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК ФИОЗаемщика,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК НомерТелефона
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВ.Вставить("ФИОЗаемщика", Выборка.ФИОЗаемщика);
		СтруктураВ.Вставить("НомерТелефона", Выборка.НомерТелефона);  
	КонецЕсли;
	Возврат СтруктураВ;
КонецФункции

&НаКлиенте
Процедура ЗачислитьПослеУточнения(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;	    
	
	СтрокаР = РасшифровкаПереплаты[РасшифровкаПереплаты.Количество()-1];
    ИдентификаторСтроки = СтрокаР.ПолучитьИдентификатор();
    Элементы.РасшифровкаПереплаты.ТекущаяСтрока = ИдентификаторСтроки;

	ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные; 
	ТекСтрока.ЗалоговыйБилет = Результат.ЗалоговыйБилет;
	ТекСтрока.НомерЗБФакт = Результат.НомерЗБ; 	 
	
	ОстатокПереплаты = ПолучитьОстатокПереплаты(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ); 
	
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ОстатокПереплаты);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	Результат = ЗачислитьПлатеж(СтруктураПлатежа);
	Если Результат = неопределено Тогда    
		Предупреждение("Ошибка при зачислении переплаты. Обратитесь к разработчикам.", 60);
	Иначе	
		ТекСтрока.ИтоговыйСтатус = Результат.СтатусПлатежа;
		ТекСтрока.ОплатаПроценты = Результат.ОплатаПроценты; 
		ТекСтрока.ОплатаЗайм = Результат.ОплатаЗайм; 
		ТекСтрока.Переплата = Результат.Переплата;  
		ТекСтрока.ДокументОплаты = Результат.ДокументОплаты;
		
		СтатусПлатежа = ?(Результат.Переплата = 0, ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоПолностью"), ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ЗачисленоЧастично"));  
		СтруктураПлатежа.Вставить("Переплата", ОстатокПереплаты); 
		ТекСтрокаП = Элементы.Переплаты.ТекущиеДанные; 
		СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрокаП.СуммаПлатежа);
		ДатаПеревода = РаспределениеПереплаты(СтатусПлатежа, СтруктураПлатежа, Результат.ДокументОплаты); 
		Если ДатаПеревода = неопределено Тогда    
			Предупреждение("Ошибка при зачислении переплаты. Обратитесь к разработчикам.", 60);
		Иначе	    
			Если НЕ ПустаяСтрока(Результат.Сообщение) Тогда
				Предупреждение(Результат.Сообщение, 60);
			КонецЕсли;	

			ТекСтрока.ДатаПеревода = ДатаПеревода;     
			ТекСтрока.Ответственный = ТекущийПользователь(); 
			Стр = РасшифровкаПереплаты.Добавить();
			Стр.ДатаПлатежа = ТекСтрока.ДатаПлатежа;
			Стр.ИдентификаторПлатежа = ТекСтрока.ИдентификаторПлатежа;
			Стр.НомерЗБ = ТекСтрока.НомерЗБ; 
			Стр.СуммаПлатежа = ТекСтрока.СуммаПлатежа;
	        Стр.ПереплатаНачальная = ТекСтрока.Переплата;
			Элементы.Переплаты.Обновить();
   		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры


&НаСервере
Функция РаспределениеПереплаты(НовыйСтатусПлатежа, СтруктураПлатежа, ДокументОплаты = неопределено)
	НовыйДок = Документы.ЛБ_РаспределениеПереплаты.СоздатьДокумент();
	НовыйДок.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей; 
	НовыйДок.ИдентификаторПлатежа =	СтруктураПлатежа.ИдентификаторПлатежа;
	НовыйДок.ДатаПлатежа =	СтруктураПлатежа.ДатаПлатежа;
	НовыйДок.НомерЗБ =	СтруктураПлатежа.НомерЗБ;
	НовыйДок.ЗалоговыйБилет =	СтруктураПлатежа.ЗалоговыйБилет; 
	НовыйДок.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа;
	НовыйДок.Переплата = СтруктураПлатежа.Переплата; 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
    НовыйДок.НовыйСтатусПлатежа = НовыйСтатусПлатежа;
	НовыйДок.Дата = ТекущаяДатаСеанса();  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.Изменение;
	Если НЕ ДокументОплаты = неопределено Тогда
		НовыйДок.ДокументОплаты = ДокументОплаты;
	КонецЕсли;	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовыйДок.Дата;
	Исключение	              
		Возврат Неопределено;
	КонецПопытки	
КонецФункции	  

&НаСервере
Функция РаспределениеПереплатыОтмена(СтруктураПлатежа, ДокументОплаты = неопределено)
	НовыйДок = Документы.ЛБ_РаспределениеПереплаты.СоздатьДокумент();
	НовыйДок.РеестрПлатежей = СтруктураПлатежа.РеестрПлатежей; 
	НовыйДок.ИдентификаторПлатежа =	СтруктураПлатежа.ИдентификаторПлатежа;
	НовыйДок.ДатаПлатежа =	СтруктураПлатежа.ДатаПлатежа;
	НовыйДок.НомерЗБ =	СтруктураПлатежа.НомерЗБ;
	НовыйДок.ЗалоговыйБилет =	СтруктураПлатежа.ЗалоговыйБилет;
	НовыйДок.СуммаПлатежа = СтруктураПлатежа.СуммаПлатежа; 
	НовыйДок.Переплата = СтруктураПлатежа.Переплата; 
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДок.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен;
	НовыйДок.Дата = ТекущаяДатаСеанса();  
	НовыйДок.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения;
	Если НЕ ДокументОплаты = неопределено Тогда
		НовыйДок.ДокументОплаты = ДокументОплаты;
	КонецЕсли;	
	НовыйДок.Записать(РежимЗаписиДокумента.Запись);
	
	Попытка   
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);   
		Возврат Истина;
	Исключение	              
		Возврат Ложь;
	КонецПопытки	
КонецФункции	


&НаСервере
Функция ТекущийПользователь() 
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаКлиенте
Процедура ВозвратПлатежа(Команда)    
		ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если ТекСтрока.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
		Возврат;
	КонецЕсли;	 
	
	СтрокаР = РасшифровкаПереплаты[РасшифровкаПереплаты.Количество()-1];
    ИдентификаторСтроки = СтрокаР.ПолучитьИдентификатор();
    Элементы.РасшифровкаПереплаты.ТекущаяСтрока = ИдентификаторСтроки;
	
	ОстатокПереплаты = ПолучитьОстатокПереплаты(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ); 
	Если ОстатокПереплаты = 0 Тогда
		Предупреждение("Сумма переплаты полностью распределена.", 60);
		Возврат; 
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено");
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("Переплата", ОстатокПереплаты);
	ДатаПеревода = РаспределениеПереплаты(НовыйСтатусПлатежа, СтруктураПлатежа);
	Если ДатаПеревода = неопределено Тогда    
		Предупреждение("Ошибка при возврате платежа. Обратитесь к разработчикам.", 60);
	Иначе	 
		ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;
		ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
		ТекСтрока.ДатаПеревода = ДатаПеревода;  
		ТекСтрока.Ответственный = ТекущийПользователь(); 
		ТекСтрока.Возврат = ТекСтрока.ПереплатаНачальная;
		Элементы.Переплаты.Обновить(); 
	КонецЕсли;	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеОтветаНаВопросОтмена(Результат, Параметры) Экспорт 

	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;
        СтруктураПлатежа = Новый Структура;	
		СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
		СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
		СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
		СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
		СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
		СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
		СтруктураПлатежа.Вставить("Переплата", ТекСтрока.ПереплатаНачальная);
		РезультатОтмены = РаспределениеПереплатыОтмена(СтруктураПлатежа);
		Если РезультатОтмены = Ложь Тогда    
			Предупреждение("Ошибка при отмене переплаты. Обратитесь к разработчикам.", 60);
		Иначе	        
			ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.ПереплатаНачальная); 
			Элементы.Переплаты.Обновить(); 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры		

&НаКлиенте
Процедура ОтнесеноВДоходы(Команда)	
	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;    
	Если ТекСтрока.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
		Возврат;
	КонецЕсли;	
	
	СтрокаР = РасшифровкаПереплаты[РасшифровкаПереплаты.Количество()-1];
    ИдентификаторСтроки = СтрокаР.ПолучитьИдентификатор();
    Элементы.РасшифровкаПереплаты.ТекущаяСтрока = ИдентификаторСтроки;

	ОстатокПереплаты = ПолучитьОстатокПереплаты(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ); 
	Если ОстатокПереплаты = 0 Тогда
		Предупреждение("Сумма переплаты полностью распределена.", 60);
		Возврат; 
	КонецЕсли;	
		
	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы");
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа); 
	СтруктураПлатежа.Вставить("Переплата", ОстатокПереплаты);
	ДатаПеревода = РаспределениеПереплаты(НовыйСтатусПлатежа, СтруктураПлатежа);
	Если ДатаПеревода = неопределено Тогда    
		Предупреждение("Ошибка при отнесении платежа в доходы. Обратитесь к разработчикам.", 60);
	Иначе
		ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;
		ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
		ТекСтрока.ДатаПеревода = ДатаПеревода;
		ТекСтрока.Ответственный = ТекущийПользователь();
		Элементы.Переплаты.Обновить();	
	КонецЕсли;			
КонецПроцедуры

&НаСервере
Функция ОтменаОплатыНаСервере(ДокументОплаты)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ДокументОплаты.Дата;
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОплаты;  
	ЗалоговыйБилет = ДокументОплаты.ПредыдущаяОперация; 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = ЗалоговыйБилет.Организация; 
	ДокументОбъект.Товары.Загрузить(ДокументОплаты.Товары.Выгрузить());
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ЗалоговыйБилет.Залогодатель);
	
	ДокументОбъект.Ломбард = ДокументОплаты.Ломбард; 
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.ОтмененныйДокумент = ДокументОплаты; 
	
	СостояниеЗБДоОплаты = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ДокументОплаты, ЗалоговыйБилет);
	ДокументОбъект.НомерДопСоглашения = СостояниеЗБДоОплаты.НомерДопСоглашения; 
	ДокументОбъект.ДатаВыкупа = СостояниеЗБДоОплаты.ДатаВыкупа;
	ДокументОбъект.ДатаВыкупаЛьготная = СостояниеЗБДоОплаты.ДатаВыкупаЛьготныйСрок;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ДокументОплаты.Дата-1); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК Задолженность
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
    ТаблицаОЗ = Запрос.Выполнить().Выгрузить();
	
    ДокументОбъект.ТоварыОтмена.Очистить();
	Для каждого стр из ДокументОбъект.Товары Цикл 		
		СтрТОт = ДокументОбъект.ТоварыОтмена.Добавить();
		СтрТОт.ОбъектЗалога = стр.ОбъектЗалога;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиОЗ = ТаблицаОЗ.НайтиСтроки(Отбор);   
		Если НЕ СтрокиОЗ.Количество() = 0 Тогда 
			СтрОЗ = СтрокиОЗ.Получить(0);
			СтрТОт.Статус = СтрОЗ.СтатусОбъектаЗалога;
			СтрТОт.СуммаОценки = СтрОЗ.Задолженность;
		КонецЕсли;	
	Конеццикла;
			
	СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ДокументОбъект.НомерЗалоговогоБилета, ДокументОплаты.Дата-1,, Истина);
	
	Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
		ДокументОбъект.СуммаОплаты = -ДокументОплаты.СуммаОплаты;
		ДокументОбъект.СуммаОплатыПроценты = -ДокументОплаты.СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = -ДокументОплаты.СуммаОплатыСсуда;
		ДокументОбъект.СуммаСсуды = СостояниеДоОтменяемойОперации.Регистратор.СуммаСсуды;
		ДокументОбъект.Выкуп = СостояниеДоОтменяемойОперации.Регистратор.Выкуп;
		ДокументОбъект.ВыдачаЗалога = СостояниеДоОтменяемойОперации.Регистратор.ВыдачаЗалога;
	КонецЕсли;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка         		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументОтмены = ДокументОбъект.Ссылка;
		
		//Установка отментки об отмене документа в отменяемом документе
		ОтменяемыйДокумент = ДокументОплаты.ПолучитьОбъект();
		ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		
		ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);	
		Попытка           
			ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
			Возврат Истина;
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе"); 
			Возврат ложь;
		КонецПопытки;
   	Исключение   
		Возврат ложь;
	КонецПопытки;  	
КонецФункции  

&НаСервере
Функция МожноОтменитьОплату(ДатаПлатежа, ИдентификаторПлатежа, НомерЗБ, ДатаПеревода)
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
	Запрос.УстановитьПараметр("ДатаПеревода", ДатаПеревода); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период КАК Период,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ПереплатаНачальная КАК ПереплатаНачальная,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.СтатусПлатежа КАК СтатусПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РеестрБезначныхПлатежейПереплаты
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.Период > &ДатаПеревода
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
		ТаблицаНачальныхПереплат = ТаблицаЗапроса.Скопировать(); 
		ТаблицаНачальныхПереплат.Свернуть("ПереплатаНачальная");
		Для Каждого Стр Из ТаблицаНачальныхПереплат Цикл	
			Отбор = новый Структура;
			Отбор.Вставить("ПереплатаНачальная", Стр.ПереплатаНачальная);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
			Если Строки.Количество() > 1 Тогда
				СтрЗ = Строки.Получить(0);
				Если СтрЗ.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли; 
			Возврат Ложь;
		КонецЦикла;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьПлатежОтмена(ДатаПроверки, ЗалоговыйБилет) 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета; 
	
	СообщениеПроверки = "";
	СтруктураВ = ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыРегламентныеНачисленияОтменаБН(ДатаПроверки, ЗалоговыйБилет); 
	Если НЕ СтруктураВ = неопределено Тогда   
		Если СтруктураВ.Вид = 0 Тогда //наличная/безнал оплата
			СообщениеПроверки = "По залоговому билету № "  + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) +  " есть платеж от " + Формат(СтруктураВ.Период, "ДЛФ=DT"); 
		ИначеЕсли СтруктураВ.Вид = 1 Тогда //регл. начисление 
			СообщениеПроверки = "По залоговому билету № "  + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) +  " есть /регламентное начисление процентов от " + Формат(СтруктураВ.Период, "ДЛФ=DT");
		КонецЕсли;	
	КонецЕсли;   
	
	Возврат СообщениеПроверки;
КонецФункции

&НаКлиенте
Процедура ОтменаПлатежа(Команда)
	ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекСтрока.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
		Возврат;
	КонецЕсли;	

	ТекСтрокаПереплаты = Элементы.Переплаты.ТекущиеДанные;
	
	Если ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено") Тогда 
		Если НЕ СотрудникЦО Тогда 
			Предупреждение("Переплата возвращена, для отмены операции возврата обратитесь к сотруднику ЦО.", 60);
		    Возврат; 
		Иначе  
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтмена", ЭтаФорма); 
            ПоказатьВопрос(Оповещение, "Отменить операцию возврата переплаты?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да,);
        КонецЕсли;	
	ИначеЕсли ТекСтрока.ИтоговыйСтатус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы") Тогда 
		Если НЕ СотрудникЦО Тогда 
			Предупреждение("Переплата отнесена в доходы, для отмены операции обратитесь к сотруднику ЦО.", 60);
		    Возврат; 
		Иначе  
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтмена", ЭтаФорма); 
            ПоказатьВопрос(Оповещение, "Отменить операцию отнесения переплаты в доходы?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да,);
        КонецЕсли;	
	Иначе	
		Если ТекСтрока.ДатаПеревода = Дата(1,1,1) Тогда
			Возврат;
		КонецЕсли;	
		Если МожноОтменитьОплату(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.ДатаПеревода) Тогда
			Если ЗначениеЗаполнено(ТекСтрока.ДокументОплаты)  Тогда  				
				ДатаПроверки = КонецДня(ТекСтрока.ДатаПлатежа)-9; 
				СообщениеПроверки = ПроверитьПлатежОтмена(ДатаПроверки, ТекСтрока.ЗалоговыйБилет);
								
				Если НЕ ПустаяСтрока(СообщениеПроверки) Тогда 
					СообщениеПроверки = СообщениеПроверки + Символы.ПС + "Отмена платежа запрещена.";
					Предупреждение(СообщениеПроверки, 60);
					Возврат; 
				КонецЕсли;   
						  
				Результат = ОтменаОплатыНаСервере(ТекСтрока.ДокументОплаты);
				Если НЕ Результат  Тогда    
					Предупреждение("Ошибка при отмене учета переплаты. Обратитесь к разработчикам.", 60);
				Иначе							
					СтруктураПлатежа = Новый Структура;	
					СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
					СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
					СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
					СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
					СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
					СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
				    СтруктураПлатежа.Вставить("Переплата", ТекСтрока.ПереплатаНачальная);
					РезультатОтмены = РаспределениеПереплатыОтмена(СтруктураПлатежа, ТекСтрока.ДокументОплаты);
					Если НЕ РезультатОтмены Тогда    
						Предупреждение("Ошибка при отмене изменения статуса переплаты. Обратитесь к разработчикам.", 60);
					Иначе	        
						ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.ПереплатаНачальная);  
						Элементы.Переплаты.Обновить(); 
					КонецЕсли;	
				КонецЕсли;	  
			Иначе	            
			    СтруктураПлатежа = Новый Структура;	
				СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
				СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
				СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
				СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
				Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда
				    СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
				Иначе  
					СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрокаПереплаты.ЗалоговыйБилет);
				КонецЕсли;	
				СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
				СтруктураПлатежа.Вставить("Переплата", ТекСтрока.ПереплатаНачальная);
				РезультатОтмены = РаспределениеПереплатыОтмена(СтруктураПлатежа);
				Если НЕ РезультатОтмены Тогда    
					Предупреждение("Ошибка при отмене переплаты. Обратитесь к разработчикам.", 60);
				Иначе	        
					ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.ПереплатаНачальная);
					Элементы.Переплаты.Обновить(); 
				КонецЕсли;	
			КонецЕсли;  
		Иначе	
			Предупреждение("Невозможно корректно отменить операцию зачисления, т.к. существуют более поздние операции.", 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПлатежа(Команда)
	ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РеестрПлатежей", РеестрПлатежей);
	ПараметрыФормы.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	ПараметрыФормы.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа); 
	ПараметрыФормы.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа); 
	ПараметрыФормы.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа); 
   	
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияБезналичногоПлатежа", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПереплаты(Команда)
	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РеестрПлатежей", РеестрПлатежей);
	ПараметрыФормы.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	ПараметрыФормы.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа); 
	ПараметрыФормы.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа); 
	ПараметрыФормы.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	ПараметрыФормы.Вставить("Переплата", ТекСтрока.Переплата); 
	   
	ОткрытьФорму("ОбщаяФорма.ЛБ_ИсторияПереплаты", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПолучитьПереплаты() 
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.НомерЗБ КАК НомерЗБ,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа КАК ДатаПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.СуммаПлатежа КАК СуммаПлатежа,
	               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(, РеестрПлатежей = &РеестрПлатежей) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних
	               |		ПО ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей = ЛБ_РеестрБезначныхПлатежейСрезПоследних.РеестрПлатежей
	               |			И ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ = ЛБ_РеестрБезначныхПлатежейСрезПоследних.НомерЗБ
	               |			И ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа = ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДатаПлатежа
	               |			И ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа = ЛБ_РеестрБезначныхПлатежейСрезПоследних.ИдентификаторПлатежа
	               |			И (НЕ ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа = ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата)
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата <> 0
	               |	И НЕ ЛБ_РеестрБезначныхПлатежейСрезПоследних.СтатусПлатежа = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен)
	               |	И НЕ ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток = 0";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаПереплат.Загрузить(ТаблицаЗапроса); 	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратитьВсе(Команда)      
	ПолучитьПереплаты();  
	Если НЕ ТаблицаПереплат.Количество() = 0 Тогда
		Для каждого Стр Из ТаблицаПереплат Цикл
			ОстатокПереплаты = ПолучитьОстатокПереплаты(Стр.ДатаПлатежа, Стр.ИдентификаторПлатежа, Стр.НомерЗБ); 
			Если ОстатокПереплаты = 0 Тогда
				Продолжить;
			КонецЕсли;	

			НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Возвращено");
			СтруктураПлатежа = Новый Структура;	
			СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
			СтруктураПлатежа.Вставить("ИдентификаторПлатежа", Стр.ИдентификаторПлатежа);
			СтруктураПлатежа.Вставить("ДатаПлатежа", Стр.ДатаПлатежа);
			СтруктураПлатежа.Вставить("НомерЗБ", Стр.НомерЗБ);
			СтруктураПлатежа.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
			СтруктураПлатежа.Вставить("СуммаПлатежа", Стр.СуммаПлатежа);
			СтруктураПлатежа.Вставить("Переплата", ОстатокПереплаты);
			ДатаПеревода = РаспределениеПереплаты(НовыйСтатусПлатежа, СтруктураПлатежа);
			Если ДатаПеревода = неопределено Тогда    
				Предупреждение("Ошибка при возврате переплаты (" + СокрЛП(Стр.НомерЗБ) + "). Обратитесь к разработчикам.", 60);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	  
		Элементы.Переплаты.Обновить();  
		ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
		Если ТекСтрока = неопределено Тогда
			Возврат;
		КонецЕсли;
		ЗаполнитьРасшифровку(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ, ТекСтрока.СуммаПлатежа, ТекСтрока.Переплата);  
	Иначе
		Предупреждение("Переплаты для возврата не найдены.", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КВозврату(Команда)
	ТекСтрока = Элементы.Переплаты.ТекущиеДанные;  
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;    
	Если ТекСтрока.СтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.Отменен") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаР = РасшифровкаПереплаты[РасшифровкаПереплаты.Количество()-1];
    ИдентификаторСтроки = СтрокаР.ПолучитьИдентификатор();
    Элементы.РасшифровкаПереплаты.ТекущаяСтрока = ИдентификаторСтроки;

	ОстатокПереплаты = ПолучитьОстатокПереплаты(ТекСтрока.ДатаПлатежа, ТекСтрока.ИдентификаторПлатежа, ТекСтрока.НомерЗБ); 
	Если ОстатокПереплаты = 0 Тогда
		Предупреждение("Сумма переплаты полностью распределена.", 60);
		Возврат; 
	КонецЕсли;	

	НовыйСтатусПлатежа = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыБезналичныхПлатежей.КВозврату");
	СтруктураПлатежа = Новый Структура;	
	СтруктураПлатежа.Вставить("РеестрПлатежей", РеестрПлатежей); 
	СтруктураПлатежа.Вставить("ИдентификаторПлатежа", ТекСтрока.ИдентификаторПлатежа);
	СтруктураПлатежа.Вставить("ДатаПлатежа", ТекСтрока.ДатаПлатежа);
	СтруктураПлатежа.Вставить("НомерЗБ", ТекСтрока.НомерЗБ);
	СтруктураПлатежа.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);
	СтруктураПлатежа.Вставить("СуммаПлатежа", ТекСтрока.СуммаПлатежа);
	СтруктураПлатежа.Вставить("Переплата", ОстатокПереплаты);
	ДатаПеревода = РаспределениеПереплаты(НовыйСтатусПлатежа, СтруктураПлатежа);
	Если ДатаПеревода = неопределено Тогда    
		Предупреждение("Ошибка установки статуса платежа ""К возврату"". Обратитесь к разработчикам.", 60);
	Иначе	 
		ТекСтрока = Элементы.РасшифровкаПереплаты.ТекущиеДанные;
		ТекСтрока.ИтоговыйСтатус = НовыйСтатусПлатежа;  
		ТекСтрока.ДатаПеревода = ДатаПеревода;  
		ТекСтрока.Ответственный = ТекущийПользователь(); 
		Элементы.Переплаты.Обновить(); 
	КонецЕсли;	
КонецПроцедуры
